{
    "work": [
        {
            "institution" : "Sitecore",
            "title" : "Solutions/Technical Consultant, Professional Services",
            "location" : "Remote",
            "dateStarted" : "Nov 2022",
            "dateEnded" : "Oct 2024",
            "description" : [
                "Developed custom Sitecore components and functionality catered to client's needs",
                "Advised clients on best practices for code implementation and site architecture",
                "Collaborated with DevOps teams to improve continuous integration and deployment pipelines",
                "Fostered strong client relationships to ensure clear communication and successful project outcomes"
            ],
            "skills" : [
                "Next.js",
                "TypeScript",
                "SCSS", 
                ".NET Core",
                "Docker"
            ]
        },
        {
            "institution" : "Sitecore",
            "title" : "Senior Software Engineer, Product Support Services",
            "location" : "Remote",
            "dateStarted" : "Oct 2021",
            "dateEnded" : "Oct 2022",
            "descriptionNote" : "In addition to previous responsibilities: ",
            "description" : [
                "Coordinated training schedules for all new team members onboarding with the North America team",
                "Instructor and examiner in C#, .NET Core, and Sitecore technologies for new team members",
                "Led knowledge-sharing sessions to enahnce team expertise",
                "Developed tools for the support team, and contributed code to the product team"
            ],
            "skills" : [
                ".NET Core",
                "C#",
                "JavaScript", 
                "Azure App Services",
                "SQL"
            ]
        },
        {
            "institution" : "Sitecore",
            "title" : "Software Engineer, Product Support Services",
            "location" : "Gatineau, QC, Canada & Remote",
            "dateStarted" : "Jul 2018",
            "dateEnded" : "Sep 2021",
            "description" : [
                "Supported customers by addressing product issues and delivering solutions within contracted SLAs",
                "Developed patches/diagnostic pages for customers",
                "Reported bugs and feature requests, updated documentation and knowledge base articles",
                "Participated in 24x7x365 on-call support rotation providing customer support globally at any time"
            ],
            "skills" : [
                ".NET Core",
                "C#",
                "JavaScript", 
                "SQL"
            ]
        },
        {
            "institution" : "L3 WESCAM",
            "title" : "Integrated Systems Engineering Co-op ",
            "location" : "Burlington, ON, Canada",
            "dateStarted" : "Sep 2016",
            "dateEnded" : "Aug 2017",
            "description" : [
                "Regression test and troubleshoot MX products with other engineers and technicians",
                "Develop new C# utilities and maintain old software utilities for testing",
                "Update Systems documents and provide general Systems team support ",
                "Volunteered to assist in organizing and managing volleyball events in the workplace"
            ],
            "skills" : [
                "C#",
                "Microsoft Excel", 
                "Windows Batch Scripting"
            ]
        },
        {
            "institution" : "L3 WESCAM",
            "title" : "NPI Project Engineering Co-op ",
            "location" : "Burlington, ON, Canada",
            "dateStarted" : "May 2016",
            "dateEnded" : "Aug 2016",
            "description" : [
                "Supported the Project Engineering group with engineering test part acquisition",
                "Manage documentation, parts, and assemblies in WESCAM's ERP system",
                "Used VBA to create custom excel tools for specific applications"
            ],
            "skills" : [
                "VBA Excel",
                "Microsoft Excel"
            ]
        }
    ],
    "school": [
        {
            "institution" : "McMaster University",
            "title" : "Bachelor of Engineering, Mechatronics and Management",
            "location" : "Hamilton, ON, Canada",
            "dateStarted" : "Sep 2012",
            "dateEnded" : "Jun 2018",
            "description" : [
                "Mechatronics combines concepts of Mechanical, Electrical, Software Engineering",
                "Management designation included Finance, Marketing, Business Operations, and more", 
                "Completed 16-month Co-op in addition to a five-year academic schedule"
            ],
            "skills" : [
                "VBA Excel",
                "Microsoft Excel"
            ]
        }
    ],
    "projects": [
        {
            "hideFromResume": true,
            "title" : "PokeGuesser",
            "githubLink" : "https://github.com/jasstsg/pokeguesser",
            "siteLink" : "https://jasstsg.github.io/pokeguesser/",
            "dateStarted" : "Oct 2024",
            "imageName": "PokeGuesser.png",
            "shortDescription": "A Pokemon guessing game built with React & TypeScript.  The project is still under construction, but future plans include integrating ChatGPT for a more engaging user experience.",
            "description" : [
                "A Pokemon guessing game built built with React & TypeScript, and deployed to GitHub Pages",
                "Retrieves data by consuming the RESTful API PokeAPI (https://pokeapi.co)",
                "Interacts with the API by using the 'pokenode-ts' node module, built with predefined types and auto-caching",
                "Future plans include integrating with AI (like ChatGPT) for a more interactive experience"
            ],
            "skills" : [
                "React",
                "TypeScript",
                "GitHub Pages"
            ]
        },
        {
            "featured": true,
            "hideFromResume": false,
            "title" : "jasst.github.io/jasstsg",
            "githubLink" : "https://github.com/jasstsg/jasstsg",
            "siteLink" : "https://jasstsg.github.io/jasstsg/",
            "dateStarted" : "Oct 2024",
            "imageName": "MySite.png",
            "shortDescription": "The site you are on right now!  It is built with React & TypeScript and serves as both my resume and portfolio.  Thank you for taking an interest in me!",
            "description" : [
                "My personal website, built with React & TypeScript, and deployed to GitHub Pages", 
                "Both a resume and portfolio showcasing my work experience, personal projects, and technical skills"
            ],
            "skills" : [
                "React",
                "TypeScript",
                "GitHub Pages"
            ]
        },
        {
            "featured": true,
            "hideFromResume": true,
            "title" : "TheTallTankard",
            "githubLink" : "https://github.com/TheTallTankard/thetalltankard.github.io",
            "siteLink" : "https://thetalltankard.github.io/",
            "dateStarted" : "Dec 2022",
            "imageName": "TheTallTankard.png",
            "shortDescription": "A React app meant to replace an earlier .NET Core app of a similar name, it instead hosts D&D 5E tools like a dice roller and ability score calculator.  Includes a planned search bar for searching D&D 5E SRD content.",
            "description" : [
                "A React app that hosts D&D 5E tools, originally intended to replace a more complex .NET Core application",
                "Implemented tools for rolling dice and calculating ability scores, supplementing gameplay and character creation",
                "Future plans include having the search bar retrieve freely accessible informaiton of the D&D 5E SRD"
            ],
            "skills" : [
                "React",
                "JavaScript",
                "GitHub Pages"
            ]
        },
        {
            "hideFromResume": true,
            "title" : "Mortgage Calculator",
            "githubLink" : "https://github.com/MooseLight/mortgage",
            "dateStarted" : "Mar 2020",
            "imageName": "CalculatorsForLife.png",
            "shortDescription": "A financial calculator app built using HTML, JavaScript, and Bootstrap, featuring mortgage payment calculations displayed a table or with visualizations built using Chart.js.",
            "description" : [
                "An application for mortgage payment calculations with a clean and intuitive user interface",
                "Used Chart.js to display clear visualizations of loan payment information over the entire amortization period",
                "Future plans include adding more calculators, loan comparisons, and custom additional payments"
            ],
            "skills" : [
                "HTML",
                "JavaScript",
                "Bootstrap"
            ]
        },
        {
            "featured": true,
            "hideFromResume": false,
            "title" : "TheTallTankardTavern",
            "githubLink" : "https://github.com/jasstsg/TheTallTankardTavern",
            "dateStarted" : "Mar 2019",
            "imageName": "TheTallTankardTavern.png",
            "shortDescription": "A .NET Core MVC app to manage data for a D&D 5E campaign, allowing remote access for players to track character progress. Hosted on IIS for real-time updates and seamless data management.",
            "description" : [
                "A .NET Core MVC app for managing character data, items, combat, and more",
                "Utilizes AJAX to make small updates for live events like changes in HP, spell slots, or money held by a character", 
                "Hosted on IIS, providing players with remote access to view and update their character data in real-time",
                "Future plans include rebuilding this application with .NET Core or Node.js for the back-end, and Next.js with TypeScript for the front-end"
            ],
            "skills" : [
                ".NET Core",
                "JavaScript"
            ]
        },
        {
            "hideFromResume": true,
            "title" : "SmartWalker",
            "githubLink" : "https://github.com/PG188/ModernMobility",
            "dateStarted" : "Mar 2019",
            "imageName": "ModernMobility.png",
            "shortDescription": "McMaster Mechatronics Engineering capstone project, an assistive walker for those who need them.  This project used OpenCV to detect ArUco markers for navigation, Arduinos with PID control to actuate the wheel motors, and socket programming for Bluetooth and Ethernet communication.",
            "description" : [
                "Assistive walker with autonomous navigation",
                "Utilized OpenCV and ArUco marker detection in Python on a raspberry pi, for positioning and autonomous navigation.",
                "Implemented PID control for wheel motors using Arduino",
                "Socket programming for Bluetooth (between RPi and mobile app) and Ethernet (between Rpi and Arduinos) communication"
            ],
            "skills" : [
                "Python",
                "OpenCV",
                "Arduino"
            ]
        }
    ]
}
